In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

### DataFrame Build Methods

In [2]:
datam = [1,2,3,4,5,6,7,8]

In [180]:
df = pd.DataFrame(data = datam, columns=["Sayılar"])

In [185]:
df.columns = ['Numbers']  # column ismini bu şekilde sayılardan numbers a çevirdik.
# köşeli paranteze dikkat
df

   Numbers
0        1
1        2
2        3
3        4
4        5
5        6
6        7
7        8

In [4]:
m = np.arange(1,10).reshape(3,3)

In [9]:
df = pd.DataFrame(m,columns=["var1 var2 var3".split()])

In [10]:
df.head(3)  # ilk 3 satırı getirme, eğer değer girilmez ise ilk bes satır gelir

  var1 var2 var3
0    1    2    3
1    4    5    6
2    7    8    9

In [15]:
df.sample()  #  rastgele datalar getirir

  var1 var2 var3
0    1    2    3

In [18]:
df.columns 
# sütunları getiri

MultiIndex([('var1',),
            ('var2',),
            ('var3',)],
           )

In [20]:
df.columns = "süt1 süt2 süt3".split()
df

   süt1  süt2  süt3
0     1     2     3
1     4     5     6
2     7     8     9

In [21]:
df.shape

(3, 3)

In [22]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

### dict ile

In [25]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [26]:
s3

array([8, 6, 0, 6, 9])

In [28]:
mydict = {"var1":s1, "var2": s2, "var3":s3}

In [29]:
df1 = pd.DataFrame(mydict)

In [30]:
df1.head()

   var1  var2  var3
0     2     0     8
1     9     5     6
2     8     4     0
3     5     2     6
4     6     3     9

In [31]:
df3 = pd.read_csv("./datasets/ornek.csv")

In [32]:
df3.head()

    a   b     c
0  10  12   3.0
1  11  33  34.0
2  44  51   NaN
3  10  12   4.0
4  11  33  35.0

In [33]:
df1

   var1  var2  var3
0     2     0     8
1     9     5     6
2     8     4     0
3     5     2     6
4     6     3     9

In [39]:
df1

   var1  var2  var3
0     2     0     8
1     9     5     6
2     8     4     0
3     5     2     6
4     6     3     9

In [43]:
df1.loc[1:4, "var1":"var2"]

   var1  var2
1     9     5
2     8     4
3     5     2
4     6     3

In [48]:
np.random.seed(101)
df3 = pd.DataFrame(np.random.randn(5,4), index = ["A B C D E".split()],
                  columns=["W X Y Z".split()])

In [49]:
type(df3["W"])

pandas.core.frame.DataFrame

In [50]:
df3[["W","Z"]]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [186]:
df3["Z"] + df3["W"]

States
CA    3.210676
NY    1.257083
WY   -2.607169
OR    1.143752
CO    0.874303
dtype: float64

In [64]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [187]:
df3["W"] + df3["Z"]

States
CA    3.210676
NY    1.257083
WY   -2.607169
OR    1.143752
CO    0.874303
dtype: float64

In [68]:
np.random.seed(101)
df3 = pd.DataFrame(np.random.randn(5,4), index="A B C D E".split(), columns = "W X Y Z".split())
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [72]:
df3["yeni sütun"] = df3["W"] + df3["Z"]
df3

          W         X         Y         Z  yeni sütun
A  2.706850  0.628133  0.907969  0.503826    3.210676
B  0.651118 -0.319318 -0.848077  0.605965    1.257083
C -2.018168  0.740122  0.528813 -0.589001   -2.607169
D  0.188695 -0.758872 -0.933237  0.955057    1.143752
E  0.190794  1.978757  2.605967  0.683509    0.874303

In [193]:
df3["yepyeni"] = df3["X"] * df3["Y"]
df3

       index         W         X         Y         Z   yepyeni
States
CA        CA  2.706850  0.628133  0.907969  0.503826  0.570325
NY        NY  0.651118 -0.319318 -0.848077  0.605965  0.270806
WY        WY -2.018168  0.740122  0.528813 -0.589001  0.391387
OR        OR  0.188695 -0.758872 -0.933237  0.955057  0.708208
CO        CO  0.190794  1.978757  2.605967  0.683509  5.156577

### Dropping

In [79]:
df3.drop(["yeni sütun", "yepyeni"],axis=1) # değişiklikler kalıcı değil

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [80]:
df3.drop(["yeni sütun"], axis=1,inplace=True)  # inplace ile kalıcı hale geldi değişmeler

In [81]:
df3

          W         X         Y         Z   yepyeni
A  2.706850  0.628133  0.907969  0.503826  0.570325
B  0.651118 -0.319318 -0.848077  0.605965  0.270806
C -2.018168  0.740122  0.528813 -0.589001  0.391387
D  0.188695 -0.758872 -0.933237  0.955057  0.708208
E  0.190794  1.978757  2.605967  0.683509  5.156577

In [194]:
df3.drop("yepyeni",axis=1,inplace=True)

In [195]:
df3

       index         W         X         Y         Z
States
CA        CA  2.706850  0.628133  0.907969  0.503826
NY        NY  0.651118 -0.319318 -0.848077  0.605965
WY        WY -2.018168  0.740122  0.528813 -0.589001
OR        OR  0.188695 -0.758872 -0.933237  0.955057
CO        CO  0.190794  1.978757  2.605967  0.683509

In [82]:
df3.drop(["A", "B"],axis=0)

          W         X         Y         Z   yepyeni
C -2.018168  0.740122  0.528813 -0.589001  0.391387
D  0.188695 -0.758872 -0.933237  0.955057  0.708208
E  0.190794  1.978757  2.605967  0.683509  5.156577

### .loc ve .iloc

In [84]:
df4 = pd.DataFrame(np.random.randint(1,30,size = (10,3)),
                  columns="var1 var2 var3".split())

In [85]:
df4

   var1  var2  var3
0     8    11    21
1    25     8     7
2    15    10    21
3    19    24     8
4     8    16    13
5     1    21    11
6    13    18    25
7    12    20    16
8     2    25     5
9    29    20    19

In [87]:
df4.loc[1:4]  # loc da stop dahil

   var1  var2  var3
1    25     8     7
2    15    10    21
3    19    24     8
4     8    16    13

In [89]:
df4.iloc[1:4]  # stop dahil değil

   var1  var2  var3
1    25     8     7
2    15    10    21
3    19    24     8

In [92]:
df4.index = "a b c d e f g h i j".split()
df4

   var1  var2  var3
a     8    11    21
b    25     8     7
c    15    10    21
d    19    24     8
e     8    16    13
f     1    21    11
g    13    18    25
h    12    20    16
i     2    25     5
j    29    20    19

In [96]:
df4.loc["a":"f"]  # f dahil

   var1  var2  var3
a     8    11    21
b    25     8     7
c    15    10    21
d    19    24     8
e     8    16    13
f     1    21    11

In [97]:
df4.loc["a":"f"]["var2"]  # çıktısı seri tipinde

a    11
b     8
c    10
d    24
e    16
f    21
Name: var2, dtype: int32

In [99]:
df4.loc["a":"f"][["var2"]]  # çift parantez ile dataframe yaptık

   var2
a    11
b     8
c    10
d    24
e    16
f    21

In [100]:
df4.loc["a","var1"]

8

In [103]:
df4.iloc[1:5,1]  # ya da df4.iloc[1:5]["var2"]

b     8
c    10
d    24
e    16
Name: var2, dtype: int32

In [104]:
df3

          W         X         Y         Z   yepyeni
A  2.706850  0.628133  0.907969  0.503826  0.570325
B  0.651118 -0.319318 -0.848077  0.605965  0.270806
C -2.018168  0.740122  0.528813 -0.589001  0.391387
D  0.188695 -0.758872 -0.933237  0.955057  0.708208
E  0.190794  1.978757  2.605967  0.683509  5.156577

In [106]:
df3.iloc[0] # iloc sadece integer değerler ile çalışır

W          2.706850
X          0.628133
Y          0.907969
Z          0.503826
yepyeni    0.570325
Name: A, dtype: float64

In [111]:
df3.iloc[:,2]

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [112]:
df3.iloc[:, 2:]

          Y         Z   yepyeni
A  0.907969  0.503826  0.570325
B -0.848077  0.605965  0.270806
C  0.528813 -0.589001  0.391387
D -0.933237  0.955057  0.708208
E  2.605967  0.683509  5.156577

In [114]:
df3[["Y"]]  # çift parantez sayesinde datafram olarak çıktı aldık

          Y
A  0.907969
B -0.848077
C  0.528813
D -0.933237
E  2.605967

In [116]:
df3["Y"]

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [197]:
df3

       index         W         X         Y         Z
States
CA        CA  2.706850  0.628133  0.907969  0.503826
NY        NY  0.651118 -0.319318 -0.848077  0.605965
WY        WY -2.018168  0.740122  0.528813 -0.589001
OR        OR  0.188695 -0.758872 -0.933237  0.955057
CO        CO  0.190794  1.978757  2.605967  0.683509

In [201]:
df3['W']>0

States
CA     True
NY     True
WY    False
OR     True
CO     True
Name: W, dtype: bool

In [202]:
df3['Y']>1

States
CA    False
NY    False
WY    False
OR    False
CO     True
Name: Y, dtype: bool

In [203]:
df3[df3["W"]>0]["Y"]

States
CA    0.907969
NY   -0.848077
OR   -0.933237
CO    2.605967
Name: Y, dtype: float64

In [204]:
df3[df3["W"]>0][["Y","Z"]]

               Y         Z
States
CA      0.907969  0.503826
NY     -0.848077  0.605965
OR     -0.933237  0.955057
CO      2.605967  0.683509

In [128]:
df3[(df3['W']>0) & (df3['Y']>0.5)]

          W         X         Y         Z   yepyeni
A  2.706850  0.628133  0.907969  0.503826  0.570325
E  0.190794  1.978757  2.605967  0.683509  5.156577

In [129]:
df3[(df3['W']>0) | (df3['Y']>0.5)]

          W         X         Y         Z   yepyeni
A  2.706850  0.628133  0.907969  0.503826  0.570325
B  0.651118 -0.319318 -0.848077  0.605965  0.270806
C -2.018168  0.740122  0.528813 -0.589001  0.391387
D  0.188695 -0.758872 -0.933237  0.955057  0.708208
E  0.190794  1.978757  2.605967  0.683509  5.156577

In [132]:
df3.reset_index()

  index         W         X         Y         Z   yepyeni
0     A  2.706850  0.628133  0.907969  0.503826  0.570325
1     B  0.651118 -0.319318 -0.848077  0.605965  0.270806
2     C -2.018168  0.740122  0.528813 -0.589001  0.391387
3     D  0.188695 -0.758872 -0.933237  0.955057  0.708208
4     E  0.190794  1.978757  2.605967  0.683509  5.156577

In [133]:
df3.reset_index(drop=True)  # indexleri de çıktıdan kaldırdı

          W         X         Y         Z   yepyeni
0  2.706850  0.628133  0.907969  0.503826  0.570325
1  0.651118 -0.319318 -0.848077  0.605965  0.270806
2 -2.018168  0.740122  0.528813 -0.589001  0.391387
3  0.188695 -0.758872 -0.933237  0.955057  0.708208
4  0.190794  1.978757  2.605967  0.683509  5.156577

In [134]:
df3.index = "CA NY WY OR CO".split()

In [135]:
df3

           W         X         Y         Z   yepyeni
CA  2.706850  0.628133  0.907969  0.503826  0.570325
NY  0.651118 -0.319318 -0.848077  0.605965  0.270806
WY -2.018168  0.740122  0.528813 -0.589001  0.391387
OR  0.188695 -0.758872 -0.933237  0.955057  0.708208
CO  0.190794  1.978757  2.605967  0.683509  5.156577

In [136]:
df3.reset_index(inplace=True)

In [138]:
df3['States'] = "CA NY WY OR CO".split()
df3

  index         W         X         Y         Z   yepyeni States
0    CA  2.706850  0.628133  0.907969  0.503826  0.570325     CA
1    NY  0.651118 -0.319318 -0.848077  0.605965  0.270806     NY
2    WY -2.018168  0.740122  0.528813 -0.589001  0.391387     WY
3    OR  0.188695 -0.758872 -0.933237  0.955057  0.708208     OR
4    CO  0.190794  1.978757  2.605967  0.683509  5.156577     CO

In [139]:
df3.set_index('States',inplace = True)

In [140]:
df3

       index         W         X         Y         Z   yepyeni
States
CA        CA  2.706850  0.628133  0.907969  0.503826  0.570325
NY        NY  0.651118 -0.319318 -0.848077  0.605965  0.270806
WY        WY -2.018168  0.740122  0.528813 -0.589001  0.391387
OR        OR  0.188695 -0.758872 -0.933237  0.955057  0.708208
CO        CO  0.190794  1.978757  2.605967  0.683509  5.156577

### MultiIndex

In [142]:
outside = ['M1', 'M1', 'M1', 'M2', 'M2', 'M2']
inside = [1, 2, 3, 1, 2, 3]
multi_index = list(zip(outside, inside))
multi_index

[('M1', 1), ('M1', 2), ('M1', 3), ('M2', 1), ('M2', 2), ('M2', 3)]

In [145]:
hier_index = pd.MultiIndex.from_tuples(multi_index)
hier_index
# hiyerarşik bir index oluşturduk. 
# öncesinde çift değerlerden oluşan tuple lar oluşturduk.

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3)],
           )

In [146]:
df5 = pd.DataFrame(np.random.randn(6,2), index=hier_index,
                  columns=['A', 'B'])

In [148]:
df5

             A         B
M1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
M2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [151]:
df5.loc['M1']

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [153]:
df5.loc['M1'].loc[[1]]

          A        B
1 -0.497104 -0.75407

In [155]:
df5.xs('M1')  # loc['M1']

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [162]:
df5.xs(('M1',1))  # M1 1 geldi

A   -0.497104
B   -0.754070
Name: (M1, 1), dtype: float64

In [163]:
df = sns.load_dataset('planets')

In [164]:
df.sample()

       method  number  orbital_period  mass  distance  year
1030  Transit       1        3.941507   NaN     172.0  2006

In [165]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [166]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [167]:
df.shape

(1035, 6)

In [168]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [169]:
df.iloc[1:5,2:4]

   orbital_period   mass
1         874.774   2.21
2         763.000   2.60
3         326.030  19.40
4         516.220  10.50

In [174]:
df.drop('number',axis=1)  # drop yaparken axis unutma
# inplace eklersen kalıcı siler

               method  orbital_period   mass  distance  year
0     Radial Velocity      269.300000   7.10     77.40  2006
1     Radial Velocity      874.774000   2.21     56.95  2008
2     Radial Velocity      763.000000   2.60     19.84  2011
3     Radial Velocity      326.030000  19.40    110.62  2007
4     Radial Velocity      516.220000  10.50    119.47  2009
...               ...             ...    ...       ...   ...
1030          Transit        3.941507    NaN    172.00  2006
1031          Transit        2.615864    NaN    148.00  2007
1032          Transit        3.191524    NaN    174.00  2007
1033          Transit        4.125083    NaN    293.00  2008
1034          Transit        4.187757    NaN    260.00  2008

[1035 rows x 5 columns]

In [175]:
df[(df['mass']>3) & (df['distance']>180)]

              method  number  orbital_period  mass  distance  year
161  Radial Velocity       2           428.5  15.2    214.00  2009
181  Radial Velocity       2          1022.0   3.4    354.00  2011
245  Radial Velocity       1           471.6  14.0    300.30  2005
396  Radial Velocity       1           647.3   4.0    221.24  2011
563  Radial Velocity       1          4885.0   3.1    189.39  2009
587  Radial Velocity       1           875.5   9.9    352.11  2012
610  Radial Velocity       1           672.1  11.1    289.02  2012
620  Radial Velocity       1           745.7   5.3    307.69  2011